{"data":{"site":{"siteMetadata":{"title":"TunedReality","author":"Vinay"}},"markdownRemark":{"id":"7d130caf-f44d-5597-8e36-647f46b47b5d","excerpt":"It’s been 5 yrs since I started my career in software industry. I switched jobs, started my own startup and failed in it, although I evaluate myself from time…","html":"<p>It’s been 5 yrs since I started my career in software industry. I switched jobs, started my own startup and failed in it, although I evaluate myself from time to time it’s time to put that in writing - this also helps me plan.</p>\n<p>I used to fear shear number of students passing out each year and then finding job while recession was still fresh in my mind. When I passed out as Elecronics and Communication Engineer I wasn’t cut out for any job in that field but programming caught my attention and decided to do Masters in Computer Science, now I feel I could have skipped college if I wanted to be where I’m today - but I wasn’t the same person back then so I don’t regret my decision. One thing I do regret is not making use of my first computer which I got at the age of 20.</p>\n<h2>Success</h2>\n<p>I have come across people talking about their success stories - most of them had access to computer and resources at very young age, thinking in that direction I am happy to be where I’m today despite being late to the party.</p>\n<h2>Introvert</h2>\n<p>Being an introvert has it’s downside in any industry, I’ve been working on it gradually but it’s a slow process. It does affect my career when I wasn’t voicing my opinion and bringing ideas to table.</p>\n<h2>Forgetfullness or Amnesia</h2>\n<p>I am fortunate to be healthy all my life and only complain I had is my forgetfulness. The best I could do is remembering my mobile number - when I learn new programming language it was never difficult to adopt and get things done but the challenge is to remember language specific consruct when I jump to learning new things.\nThis also doesn’t help me while having conversation about Data Structure and Algorithms which I honestly can’t remember unless I refer them again.</p>\n<h2>Vulnerabilities</h2>\n<p>People are building cool stuff and I’m using those libraries to meet my requirements, there is always a feeling that I’m not being part of bigger open-source community where I can contribute and I’m sure it will feel nice being in that position.</p>\n<h2>Quest for learning</h2>\n<p>So far I’ve tried Android App Development, Angular, React, Java back-end, NodeJS, MySQL, MongoDB, GraphQL, AWS. I’ve documented most of my work or demo projects on <a href=\"https://github.com/vinkrish\">GitHub</a>, with this blog I’m willing to go step further document my learning, be pro-active and possibly create some content for YouTube.</p>\n<p>This year again I’m learning something new - Python / Machine Learning and DevOps with Docker and Kubernetes, I’ve my doubts on how successful I can be in this challenging field but I’m willing to give my best.</p>","frontmatter":{"title":"Recap & New Beginning","date":"January 24, 2019"}}},"pageContext":{"slug":"/hi-folks/","previous":{"fields":{"slug":"/hello-world/"},"frontmatter":{"title":"Hello World"}},"next":{"fields":{"slug":"/markdown/"},"frontmatter":{"title":""}}}}